### 📖 Terraform Plan (infra/modules/azure_core_infra/example/complete) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.core.azurerm_resource_group.common will be created
  + resource "azurerm_resource_group" "common" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-common-rg-01"
      + tags     = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
    }

  # module.core.azurerm_resource_group.gh_runner will be created
  + resource "azurerm_resource_group" "gh_runner" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-github-runner-rg-01"
      + tags     = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
    }

  # module.core.azurerm_resource_group.network will be created
  + resource "azurerm_resource_group" "network" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-network-rg-01"
      + tags     = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
    }

  # module.core.azurerm_resource_group.opex will be created
  + resource "azurerm_resource_group" "opex" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-opex-rg-01"
      + tags     = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
    }

  # module.core.azurerm_resource_group.test[0] will be created
  + resource "azurerm_resource_group" "test" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-test-rg-01"
      + tags     = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
    }

  # module.core.module.application_insights.azurerm_application_insights.appi will be created
  + resource "azurerm_application_insights" "appi" {
      + app_id                              = (known after apply)
      + application_type                    = "other"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = true
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "italynorth"
      + name                                = "dx-d-itn-common-appi-01"
      + resource_group_name                 = "dx-d-itn-common-rg-01"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + workspace_id                        = (known after apply)
    }

  # module.core.module.application_insights.azurerm_key_vault_secret.appinsights_instrumentation_key will be created
  + resource "azurerm_key_vault_secret" "appinsights_instrumentation_key" {
      + content_type            = "Application insights instrumentation key for dx-d-itn-common-appi-01"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "appinsights-instrumentation-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.core.module.common_log_analytics.azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "italynorth"
      + name                            = "dx-d-itn-common-log-01"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "dx-d-itn-common-rg-01"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + workspace_id                    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["azurewebsites"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurewebsites.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["blob"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["container_app"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.italynorth.azurecontainerapps.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["documents"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.documents.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["file"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.file.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["management_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "management.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["psql"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.postgres.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["queue"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.queue.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["redis"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.redis.cache.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["scm_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "scm.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["servicebus"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["srch"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.search.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["table"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.table.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["vault"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "azure-api.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["azurewebsites"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.azurewebsites.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["blob"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["container_app"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.italynorth.azurecontainerapps.io"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["documents"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.documents.azure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["file"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.file.core.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["management_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "management.azure-api.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["psql"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.postgres.database.azure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["queue"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.queue.core.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["redis"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.redis.cache.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["scm_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "scm.azure-api.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["servicebus"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.servicebus.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["srch"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.search.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["table"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.table.core.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["vault"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.github_runner.azurerm_container_app_environment.cae will be created
  + resource "azurerm_container_app_environment" "cae" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + infrastructure_subnet_id         = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "italynorth"
      + log_analytics_workspace_id       = (known after apply)
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "dx-d-itn-github-runner-cae-01"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "dx-d-itn-github-runner-rg-01"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + zone_redundancy_enabled          = false
    }

  # module.core.module.github_runner.azurerm_management_lock.lock_cae will be created
  + resource "azurerm_management_lock" "lock_cae" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "dx-d-itn-github-runner-cae-01"
      + notes      = "This Container App Environment cannot be deleted"
      + scope      = (known after apply)
    }

  # module.core.module.key_vault.azurerm_key_vault.common will be created
  + resource "azurerm_key_vault" "common" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "dx-d-itn-common-kv-01"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "dx-d-itn-common-rg-01"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + tenant_id                     = "7788edaf-0346-4068-9d79-c868aed15b3d"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.core.module.key_vault.azurerm_private_endpoint.vault will be created
  + resource "azurerm_private_endpoint" "vault" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "dx-d-itn-modules-test-kv-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dx-d-itn-network-rg-01"
      + subnet_id                = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dx-d-itn-modules-test-kv-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.core.module.network.azurerm_subnet.pep_snet will be created
  + resource "azurerm_subnet" "pep_snet" {
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "dx-d-itn-pep-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "dx-d-itn-network-rg-01"
      + virtual_network_name                          = "dx-d-itn-common-vnet-01"
    }

  # module.core.module.network.azurerm_subnet.runner_snet will be created
  + resource "azurerm_subnet" "runner_snet" {
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "dx-d-itn-github-runner-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "dx-d-itn-network-rg-01"
      + virtual_network_name                          = "dx-d-itn-common-vnet-01"
    }

  # module.core.module.network.azurerm_subnet.test_snet[0] will be created
  + resource "azurerm_subnet" "test_snet" {
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "dx-d-itn-test-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "dx-d-itn-network-rg-01"
      + virtual_network_name                          = "dx-d-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.core.module.network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space                  = [
          + "10.50.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "italynorth"
      + name                           = "dx-d-itn-common-vnet-01"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "dx-d-itn-network-rg-01"
      + subnet                         = (known after apply)
      + tags                           = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "2.1.0"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
    }

  # module.core.module.network.dx_available_subnet_cidr.pep_cidr will be created
  + resource "dx_available_subnet_cidr" "pep_cidr" {
      + cidr_block         = (known after apply)
      + id                 = (known after apply)
      + prefix_length      = 23
      + virtual_network_id = (known after apply)
    }

  # module.core.module.network.dx_available_subnet_cidr.runner_cidr will be created
  + resource "dx_available_subnet_cidr" "runner_cidr" {
      + cidr_block         = (known after apply)
      + id                 = (known after apply)
      + prefix_length      = 23
      + virtual_network_id = (known after apply)
    }

  # module.core.module.network.dx_available_subnet_cidr.test_cidr[0] will be created
  + resource "dx_available_subnet_cidr" "test_cidr" {
      + cidr_block         = (known after apply)
      + id                 = (known after apply)
      + prefix_length      = 24
      + virtual_network_id = (known after apply)
    }

Plan: 49 to add, 0 to change, 0 to destroy.
```

</details>
